In [2]:
my_dict = {}
my_dict['name'] = '홍길동동주'
my_dict['age'] = '200'
my_dict['sex'] = '중성'

print(my_dict)
print(my_dict['age'])

{'name': '홍길동동주', 'age': '200', 'sex': '중성'}
200

In [3]:
my_list = [10,20,30,40,50,60,70,80,90,100]

for i in my_list:
    print(i)

10
20
30
40
50
60
70
80
90
100

In [4]:
print(range(10)) 
list(range(10))

range(0, 10)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [5]:
def my_format(value):
    print(f'{value}가 출력되었습니다.')
    
my_format(12123)

12123가 출력되었습니다.

In [6]:
my_format2 = lambda value:f'{value:0.2f}'

my_format2(300000)

'300000.00'

In [7]:
my_format3 = lambda value:f'{value:,}'

my_format3(300000)

'300,000'

In [8]:
a = 3

print(a)
print(type(a))

3
<class 'int'>

In [9]:
a = '3'

print(a)
print(type(a))

3
<class 'str'>

In [10]:
a = (3,)

print(a)
print(type(a))

(3,)
<class 'tuple'>

In [11]:
a = [3]

print(a)
print(type(a))

[3]
<class 'list'>

In [12]:
from datetime import date

today = date.today()
print(today)

print(today.year, today.month, today.day)

2022-02-10
2022 2 10

In [13]:
birth_1 = date(1960,1,3)
birth_2 = date(1960,3,4)
print(type(birth_1))
print(birth_1, birth_2)

<class 'datetime.date'>
1960-01-03 1960-03-04

In [14]:
(7,8) < (5,2) #숫자 크기비교

False

In [15]:
(7,8) > (5,2)

True

In [16]:
(today.month, today.day) < (birth_1.month, birth_1.day) #2월 10일 < 1월 3일 (2,10)<(1,3)

False

In [17]:
(today.month, today.day) > (birth_1.month, birth_1.day)

True

In [18]:
age = today.year - birth_1.year
print(age)

62

In [19]:
age = today.year - birth_1.year-((today.month, today.day) > (birth_1.month, birth_1.day)) # (today.month, today.day) > (birth_1.month, birth_1.day) 가 true 이기때문에 1로 계산된다.
print(age)

61

In [20]:
import pandas as pd

data = {'name':['철수','영희','민수','하진','코드몽규'],
        'age':['10','20','30','40','100'],
        'birthday':['1999-01-01','1999-01-02','1900-01-01','1999-11-11','1922-01-01']}

data_df = pd.DataFrame(data)
data_df

   name  age    birthday
0    철수   10  1999-01-01
1    영희   20  1999-01-02
2    민수   30  1900-01-01
3    하진   40  1999-11-11
4  코드몽규  100  1922-01-01

In [21]:
data_df['name']

0      철수
1      영희
2      민수
3      하진
4    코드몽규
Name: name, dtype: object

In [22]:
data_df['city'] = ['서울','도쿄','베이징','LA','MARS']
data_df

   name  age    birthday  city
0    철수   10  1999-01-01    서울
1    영희   20  1999-01-02    도쿄
2    민수   30  1900-01-01   베이징
3    하진   40  1999-11-11    LA
4  코드몽규  100  1922-01-01  MARS

In [27]:
import pandas as pd
import numpy as np

s = pd.Series(['cat','dog',np.nan,'rabbit'])
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object